[
  {
    "id": 1,
    "objection": "I'm not interested.",
    "response": "Totally fair. What’s holding you back the most right now?"
  },
  {
    "id": 2,
    "objection": "I already have solar.",
    "response": "Awesome. Has it fully offset your bill, or are you still paying something?"
  },
  {
    "id": 3,
    "objection": "I rent this home.",
    "response": "Makes sense. Do you cover the utility bill or is it in the landlord’s name?"
  },
  {
    "id": 4,
    "objection": "I need to talk to my spouse.",
    "response": "Totally. If they liked the idea, would you be open to it?"
  },
  {
    "id": 5,
    "objection": "Now’s not a good time.",
    "response": "Understood. Can I ask what makes it feel off right now?"
  },
  {
    "id": 6,
    "objection": "It’s too expensive.",
    "response": "Fair point. Do you mean upfront cost or the long run?"
  },
  {
    "id": 7,
    "objection": "I don’t want panels on my roof.",
    "response": "Totally get that. Is it the look or worry about damage?"
  },
  {
    "id": 8,
    "objection": "I don’t trust solar companies.",
    "response": "I hear that a lot. What happened that made you feel that way?"
  },
  {
    "id": 9,
    "objection": "I need to think about it.",
    "response": "Of course. What part are you still unsure about?"
  },
  {
    "id": 10,
    "objection": "I’m moving soon.",
    "response": "Got it. While you’re here, would saving now still be helpful?"
  },
  {
    "id": 11,
    "objection": "I don’t pay that much for electricity.",
    "response": "Smart. Is that just efficiency or not home much?"
  },
  {
    "id": 12,
    "objection": "I’m on CARE or a discount program.",
    "response": "Makes sense. If this still saved you more, would that matter?"
  },
  {
    "id": 13,
    "objection": "I don’t want a lien or loan on my home.",
    "response": "Completely fair. Is it credit worries or resale concerns?"
  },
  {
    "id": 14,
    "objection": "I’ve heard it doesn’t work at night or in the rain.",
    "response": "That’s true. Do you know how the backup system covers that?"
  },
  {
    "id": 15,
    "objection": "I’m just renting this house to family.",
    "response": "Gotcha. Are you covering the bill or do they?"
  },
  {
    "id": 16,
    "objection": "I don’t want a long contract.",
    "response": "Totally valid. Is it the length or commitment that’s uncomfortable?"
  },
  {
    "id": 17,
    "objection": "I’ve had issues with installers before.",
    "response": "I’m sorry to hear that. What happened exactly?"
  },
  {
    "id": 18,
    "objection": "I think SCE will fix things eventually.",
    "response": "They might. But meanwhile, are you okay paying more while waiting?"
  },
  {
    "id": 19,
    "objection": "My neighbor said it wasn’t worth it.",
    "response": "Totally fair. Do you know what kind of setup they had?"
  },
  {
    "id": 20,
    "objection": "I’m waiting for battery prices to go down.",
    "response": "Makes sense. But do you think your bill will go down while you wait?"
  }
]
