[
  {
    "id": 1,
    "objection": "I'm not interested.",
    "response": "Totally fair. Just curious, what’s making you feel that way about it right now?"
  },
  {
    "id": 2,
    "objection": "I already have solar.",
    "response": "Got it. Out of curiosity, how’s that been working out for you so far?"
  },
  {
    "id": 3,
    "objection": "I rent this home.",
    "response": "That makes sense. Are you planning to stay here long-term or looking to buy soon?"
  },
  {
    "id": 4,
    "objection": "I need to talk to my spouse.",
    "response": "I respect that. Just wondering, if they were here and felt it made sense, would you be open to it?"
  },
  {
    "id": 5,
    "objection": "Now’s not a good time.",
    "response": "No worries. What’s going on that makes this feel like bad timing?"
  },
  {
    "id": 6,
    "objection": "It’s too expensive.",
    "response": "That’s fair. When you say expensive, do you mean upfront or long-term cost-wise?"
  },
  {
    "id": 7,
    "objection": "I don’t want panels on my roof.",
    "response": "Totally fair. What about them makes you feel hesitant—looks or damage concerns?"
  },
  {
    "id": 8,
    "objection": "I don’t trust solar companies.",
    "response": "I hear you. What happened in the past that made you feel that way?"
  },
  {
    "id": 9,
    "objection": "I need to think about it.",
    "response": "Of course. Just so I understand, what’s the biggest thing you’re still unsure about?"
  },
  {
    "id": 10,
    "objection": "I’m moving soon.",
    "response": "That’s smart to plan ahead. Would lowering the electric bill while you're here still be worth exploring?"
  },
  {
    "id": 11,
    "objection": "I don’t pay that much for electricity.",
    "response": "Got it. Is that because you’re super energy-efficient or are you just not home much?"
  },
  {
    "id": 12,
    "objection": "I’m on CARE or a discount program.",
    "response": "Makes sense. If the savings still beat that discount, would you want to hear about it?"
  },
  {
    "id": 13,
    "objection": "I don’t want a lien or loan on my home.",
    "response": "I hear that. What concerns you most—affecting your credit or resale?"
  },
  {
    "id": 14,
    "objection": "I’ve heard it doesn’t work at night or in the rain.",
    "response": "That’s true—it works best in sunlight. But do you know how the backup system actually covers that?"
  },
  {
    "id": 15,
    "objection": "I’m just renting this house to family.",
    "response": "Ah I see. Are you responsible for the bill or is that something they manage?"
  },
  {
    "id": 16,
    "objection": "I don’t want a long contract.",
    "response": "Totally valid. Just curious, what’s the part that makes long-term feel uncomfortable?"
  },
  {
    "id": 17,
    "objection": "I’ve had issues with installers before.",
    "response": "I’m sorry to hear that. What happened exactly?"
  },
  {
    "id": 18,
    "objection": "I think SCE will fix things eventually.",
    "response": "You might be right. But while you wait, do you want to stay on the hook for the rising bill?"
  },
  {
    "id": 19,
    "objection": "My neighbor said it wasn’t worth it.",
    "response": "That’s fair. Out of curiosity, do you know what kind of setup they got or how it was structured?"
  },
  {
    "id": 20,
    "objection": "I’m waiting for battery prices to go down.",
    "response": "Smart. Do you think the utility will lower your bill while you wait though?"
  }
]
